{
  "source": {
    "type": "youtube",
    "video_id": "tOqsgHun1ko",
    "title": "What is Dark Matter, Really?",
    "channel": "Boring Science",
    "published_at": "20251218",
    "description": "What is Dark Matter, Really?\n\n❤ If you'd like to support the channel - https://www.youtube.com/channel/UCy90ELiBAOiJrj8W22WBNbw/join\n\nDrift into the quiet mysteries of the universe with What Is Dark Matter, Really?\nIn this slow, calming space documentary, we gently explore one of the most puzzling questions in modern science — the invisible substance that holds galaxies together yet cannot be seen, touched, or directly measured.\n\nWith soft narration and peaceful pacing, this video explains what dark matter might be, how scientists discovered its presence through the motion of stars and galaxies, and why it shapes the structure of the universe without ever revealing itself. We’ll move slowly through the evidence, the theories, and the unanswered questions, turning complex cosmic science into a relaxing bedtime journey.\n\nDesigned for sleep, relaxation, and quiet curiosity, this documentary avoids overstimulation and urgency. Instead, it offers a gentle flow of ideas about gravity, cosmic balance, and the unseen forces guiding the universe — perfect for letting your thoughts drift while learning softly.\n\nClose your eyes, breathe deeply, and let the invisible side of the cosmos guide you calmly into rest. 🌙✨\n\n🌌 Thanks for watching you Amazing People!\n💤 I really hope this documentary helped you to relax, sleep, or simply calm your restless mind, do let me know below...\n\nI’d also love to know, ✅ How’s your day going, and how’s life treating you?\n– If you learned anything new? 🤔  \n– What was your favorite part/section in the video? 🧠 \n-- Did you finish the documentary or watch the video till the end? \n– And where in the world are you listening from? 🌎  \n\n✨ Subscribe for more calmly narrated science journeys through time, space and the history of the Universe: https://www.youtube.com/@BoringScienceToSleep?sub_confirmation=1\n\n#space #documentary #sleepstory #science #calmvideo #sleepvideo",
    "duration": 8470,
    "view_count": 7501
  },
  "text": {
    "transcript": "[Transcript was downloaded by yt-dlp to local storage]",
    "captions_available": true
  },
  "vision": {
    "thumbnail_labels": [],
    "shot_segments": []
  },
  "nlp": {
    "entities": [
      "Boring Science"
    ],
    "claims": [],
    "beat_map": [
      {
        "beat": 1,
        "theme": "Introduction",
        "intensity": 0.3
      }
    ]
  },
  "engine_controls": {
    "anchor_ratio_target": 0.5
  }
}